{
    "The provided password does not match your current password.": "كلمة المرور المقدمة غير مطابقة لكلمة المرور الحالية الخاصة بك.",
    "Create API Token": "إنشاء رمز مصادقة API",
    "API tokens allow third-party services to authenticate with our application on your behalf.": "تسمح رموز API للخدمات من الطرف الثالث بالمصادقة على تطبيقنا نيابة عنك.",
    "Token Name": "اسم الرمز",
    "Permissions": "الصلاحيات",
    "Created.": "تم الإنشاء.",
    "Create": "إنشاء",
    "Manage API Tokens": "إدارة رموز API",
    "You may delete any of your existing tokens if they are no longer needed.": "يمكنك حذف أي من الرموز الحالية إذا لم تعد تحتاج إليها.",
    "Last used": "آخر استخدام",
    "Delete": "حذف",
    "API Token": "رمز API",
    "Please copy your new API token. For your security, it won't be shown again.": "يرجى نسخ رمز API الجديد الخاص بك. لأسباب الأمان الخاص بك، لن يتم عرضه مرة أخرى.",
    "Close": "إغلاق",
    "API Token Permissions": "صلاحيات رمز API",
    "Cancel": "إلغاء",
    "Save": "حفظ",
    "Delete API Token": "حذف رمز API",
    "Are you sure you would like to delete this API token?": "هل أنت متأكد أنك تريد حذف رمز API هذا؟",
    "API Tokens": "رموز API",
    "Apply Filters": "تطبيق الفلاتر",
    "This is a secure area of the application. Please confirm your password before continuing.": "هذه منطقة آمنة في التطبيق. يرجى تأكيد كلمة المرور الخاصة بك قبل الاستمرار.",
    "Password": "كلمة المرور",
    "Confirm": "تأكيد",
    "Forgot your password? No problem. Just let us know your email address and we will email you a password reset link that will allow you to choose a new one.": "هل نسيت كلمة المرور الخاصة بك؟ لا توجد مشكلة. فقط اسمح لنا بمعرفة عنوان بريدك الإلكتروني وسنرسل لك رابط إعادة تعيين كلمة المرور الذي سيسمح لك بالاختيار واحدة جديدة.",
    "Email": "البريد الإلكتروني",
    "Email Password Reset Link": "إرسال رابط إعادة تعيين كلمة المرور عبر البريد الإلكتروني",
    "Remember me": "تذكرني",
    "Forgot your password?": "هل نسيت كلمة المرور؟",
    "Log in": "تسجيل الدخول",
    "Name": "الاسم",
    "User Name": "اسم المستخدم",
    "Confirm Password": "تأكيد كلمة المرور",
    "I agree to the :terms_of_service and :privacy_policy": "أوافق على :terms_of_service و :privacy_policy",
    "Terms of Service": "شروط الخدمة",
    "Privacy Policy": "سياسة الخصوصية",
    "Already registered?": "هل سجلت بالفعل؟",
    "Register": "تسجيل",
    "Reset Password": "إعادة تعيين كلمة المرور",
    "Please confirm access to your account by entering the authentication code provided by your authenticator application.": "يرجى تأكيد الوصول إلى حسابك عن طريق إدخال رمز المصادقة المقدم من تطبيق المصادقة الخاص بك.",
    "Please confirm access to your account by entering one of your emergency recovery codes.": "يرجى تأكيد الوصول إلى حسابك عن طريق إدخال أحد رموز الاسترداد الطارئة الخاصة بك.",
    "Code": "الرمز",
    "Recovery Code": "رمز الاسترداد",
    "Use a recovery code": "استخدم رمز الاسترداد",
    "Use an authentication code": "استخدم رمز المصادقة",
    "Before continuing, could you verify your email address by clicking on the link we just emailed to you? If you didn't receive the email, we will gladly send you another.": "قبل الاستمرار، هل يمكنك التحقق من عنوان بريدك الإلكتروني عن طريق النقر على الرابط الذي أرسلناه لك للتو؟ إذا لم تتلق البريد الإلكتروني، سنرسل لك بكل سرور واحد آخر.",
    "A new verification link has been sent to the email address you provided in your profile settings.": "تم إرسال رابط التحقق الجديد إلى عنوان البريد الإلكتروني الذي قدمته في إعدادات ملف التعريف الخاص بك.",
    "Resend Verification Email": "إعادة إرسال رسالة التحقق عبر البريد الإلكتروني",
    "Edit Profile": "تعديل الملف الشخصي",
    "Log Out": "تسجيل الخروج",
    "Don't Have an Account? ": "ليس لديك حساب؟ ",
    "Sign Up": "التسجيل",
    "For your security, please confirm your password to continue.": "لأسباب الأمان الخاص بك، يرجى تأكيد كلمة المرور الخاصة بك للمتابعة.",
    "Whoops! Something went wrong.": "عذراً! حدث خطأ ما.",
    "You have been invited to join the :team team!": "لقد تمت دعوتك للانضمام إلى فريق :team!",
    "If you do not have an account, you may create one by clicking the button below. After creating an account, you may click the invitation acceptance button in this email to accept the team invitation:": "إذا لم يكن لديك حساب، يمكنك إنشاء واحد عن طريق النقر على الزر أدناه. بعد إنشاء حساب، يمكنك النقر على زر قبول الدعوة في هذا البريد الإلكتروني لقبول دعوة الفريق:",
    "Create Account": "إنشاء حساب",
    "If you already have an account, you may accept this invitation by clicking the button below:": "إذا كان لديك حساب بالفعل، يمكنك قبول هذه الدعوة عن طريق النقر على الزر أدناه:",
    "You may accept this invitation by clicking the button below:": "يمكنك قبول هذه الدعوة عن طريق النقر على الزر أدناه",
    "Accept Invitation": "قبول الدعوة",
    "If you did not expect to receive an invitation to this team, you may discard this email.": "إذا لم تكن تتوقع تلقي دعوة لهذا الفريق ، يمكنك تجاهل هذا البريد الإلكتروني.",
    "Likes": "الإعجابات",
    "Comments": "التعليقات",
    "Nothing To Show Right Now!": "لا يوجد شيء للعرض الآن!",
    "View all": "عرض الكل",
    "Add Comment": "إضافة تعليق",
    "Post": "نشر",
    "Start your journey, Follow your frends": "ابدأ رحلتك ، اتبع أصدقائك",
    "Pepole you follow:": "الأشخاص الذين تتابعهم:",
    "Nothing to show right now!": "لا يوجد شيء للعرض الآن!",
    "Peopole you may want to follow:": "الأشخاص الذين قد ترغب في متابعتهم:",
    "Follow Requests": "طلبات المتابعة",
    "Pending Follow Requests": "طلبات المتابعة المعلقة",
    "Original": "الأصلي",
    "Liked By ": "تم الإعجاب بواسطة ",
    "Manage Team": "إدارة الفريق",
    "Team Settings": "إعدادات الفريق",
    "Create New Team": "إنشاء فريق جديد",
    "Switch Teams": "تبديل الفرق",
    "Manage Account": "إدارة الحساب",
    "Profile": "الملف الشخصي",
    "Login": "تسجيل الدخول",
    "Sign up": "التسجيل",
    "home": "الصفحة الرئيسية",
    "Add New Post": "إضافة منشور جديد",
    "Caption": "التعليق",
    "Image": "الصورة",
    "Publish": "نشر",
    "Edit Post": "تعديل المنشور",
    "Edit": "تعديل",
    "Login ": "تسجيل الدخول ",
    "To Like Or Comment": "للإعجاب أو التعليق",
    "Delete Account": "حذف الحساب",
    "Permanently delete your account.": "حذف حسابك نهائيًا.",
    "Once your account is deleted, all of its resources and data will be permanently deleted. Before deleting your account, please download any data or information that you wish to retain.": "بمجرد حذف حسابك ، سيتم حذف جميع موارد وبياناته بشكل دائم. قبل حذف حسابك ، يرجى تنزيل أي بيانات أو معلومات ترغب في الاحتفاظ بها.",
    "Are you sure you want to delete your account? Once your account is deleted, all of its resources and data will be permanently deleted. Please enter your password to confirm you would like to permanently delete your account.": "هل أنت متأكد أنك تريد حذف حسابك؟ بمجرد حذف حسابك ، سيتم حذف جميع موارد وبياناته بشكل دائم. يرجى إدخال كلمة المرور الخاصة بك لتأكيد رغبتك في حذف حسابك بشكل دائم.",
    "Browser Sessions": "جلسات المتصفح",
    "Manage and log out your active sessions on other browsers and devices.": "إدارة وتسجيل الخروج من جلساتك النشطة على المتصفحات والأجهزة الأخرى.",
    "If necessary, you may log out of all of your other browser sessions across all of your devices. Some of your recent sessions are listed below; however, this list may not be exhaustive. If you feel your account has been compromised, you should also update your password.": "إذا لزم الأمر ، يمكنك تسجيل الخروج من جميع جلسات المتصفح الأخرى عبر جميع أجهزتك. يتم سرد بعض جلساتك الأخيرة أدناه ؛ ومع ذلك ، قد لا تكون هذه القائمة شاملة. إذا شعرت بأن حسابك قد تم اختراقه ، فيجب عليك أيضًا تحديث كلمة المرور الخاصة بك.",
    "Unknown": "غير معروف",
    "This device": "هذا الجهاز",
    "Last active": "آخر نشاط",
    "Log Out Other Browser Sessions": "تسجيل الخروج من جلسات المتصفح الأخرى",
    "Done.": "تم.",
    "Please enter your password to confirm you would like to log out of your other browser sessions across all of your devices.": "يرجى إدخال كلمة المرور الخاصة بك لتأكيد رغبتك في تسجيل الخروج من جلسات المتصفح الأخرى عبر جميع أجهزتك.",
    "Two Factor Authentication": "المصادقة الثنائية العاملة",
    "Add additional security to your account using two factor authentication.": "أضف أمانًا إضافيًا لحسابك باستخدام المصادقة الثنائية العاملة.",
    "Finish enabling two factor authentication.": "إكمال تمكين المصادقة الثنائية العاملة.",
    "You have enabled two factor authentication.": "لقد قمت بتمكين المصادقة الثنائية العاملة.",
    "You have not enabled two factor authentication.": "لم تقم بتمكين المصادقة الثنائية العاملة.",
    "When two factor authentication is enabled, you will be prompted for a secure, random token during authentication. You may retrieve this token from your phone's Google Authenticator application.": "عند تمكين المصادقة الثنائية العاملة ، سيتم طلب رمز مؤمن وعشوائي أثناء التوثيق. يمكنك استرداد هذا الرمز من تطبيق Google Authenticator الموجود على هاتفك.",
    "To finish enabling two factor authentication, scan the following QR code using your phone's authenticator application or enter the setup key and provide the generated OTP code.": "لإكمال تمكين المصادقة الثنائية العاملة ، يرجى مسح الرمز الشريطي QR التالي باستخدام تطبيق المصادقة الخاص بجهازك أو إدخال مفتاح الإعداد وتقديم رمز OTP الذي تم إنشاؤه.",
    "Two factor authentication is now enabled. Scan the following QR code using your phone's authenticator application or enter the setup key.": "تم تمكين المصادقة الثنائية العاملة الآن. يرجى مسح الرمز الشريطي QR التالي باستخدام تطبيق المصادقة الخاص بجهازك أو إدخال مفتاح الإعداد.",
    "Setup Key": "مفتاح الإعداد",
    "Store these recovery codes in a secure password manager. They can be used to recover access to your account if your two factor authentication device is lost.": "قم بتخزين هذه الرموز الاستردادية في مدير كلمات المرور الآمن. يمكن استخدامها لاستعادة الوصول إلى حسابك إذا تم فقد جهاز المصادقة الثنائية العاملة الخاص بك.",
    "Enable": "تمكين",
    "Regenerate Recovery Codes": "إعادة إنشاء رموز الاسترداد",
    "Show Recovery Codes": "عرض رموز الاسترداد",
    "Disable": "تعطيل",
    "Update Password": "تحديث كلمة المرور",
    "Ensure your account is using a long, random password to stay secure.": "تأكد من استخدام حسابك لكلمة مرور طويلة وعشوائية للحفاظ على الأمان.",
    "Current Password": "كلمة المرور الحالية",
    "New Password": "كلمة المرور الجديدة",
    "Saved.": "تم الحفظ.",
    "Profile Information": "معلومات الملف الشخصي",
    "Update your account's profile information and email address.": "تحديث معلومات حسابك الشخصية وعنوان البريد الإلكتروني الخاص بك.",
    "Photo": "الصورة",
    "Select A New Photo": "اختر صورة جديدة",
    "Remove Photo": "إزالة الصورة",
    "username": "اسم المستخدم",
    "bio": "نبذة",
    "url": "رابط",
    "Status": "الحالة",
    "Public": "عام",
    "Private": "خاص",
    "language": "اللغة",
    "Arabic": "العربية",
    "English": "الإنجليزية",
    "Your email address is unverified.": "عنوان البريد الإلكتروني الخاص بك غير متحقق منه.",
    "Click here to re-send the verification email.": "انقر هنا لإعادة إرسال رسالة التحقق عبر البريد الإلكتروني.",
    "A new verification link has been sent to your email address.": "تم إرسال رابط التحقق الجديد إلى عنوان بريدك الإلكتروني.",
    "Add Post": "إضافة منشور",
    "posts": "المنشورات",
    "followers": "المتابعين",
    "following": "المتابعون",
    "This Account Is Private": "هذا الحساب خاص",
    "Follow To See Thier Posts": "تابع لرؤية منشوراتهم",
    "search": "البحث",
    "show": "عرض",
    "results": "النتائج",
    "of": "من",
    "to": "إلى",
    "Follow": "متابعة",
    "unfollow": "الغاء المتابعة",
    "Accept": "موافقة",
    "Accepted": "الغاء الموافقة",
    "Dont't Have an Account? ": "ليس لديك حساب؟"
}